lwfinger/rtl8723au/os_dep/ioctl_linux.c
				}
				break;
				case 0x14: //get wifi_spec
				{
					struct registry_priv	*pregpriv = &padapter->registrypriv;
					DBG_8723A("get wifi_spec=%d\n",pregpriv->wifi_spec);

				}
				break;
				case 0x16:
				{
					if(arg == 0xff){
						printk("ODM_COMP_DIG\t\tBIT0\n");
						printk("ODM_COMP_RA_MASK\t\tBIT1\n");
						printk("ODM_COMP_DYNAMIC_TXPWR\tBIT2\n");
						printk("ODM_COMP_FA_CNT\t\tBIT3\n");
						printk("ODM_COMP_RSSI_MONITOR\tBIT4\n");
						printk("ODM_COMP_CCK_PD\t\tBIT5\n");
						printk("ODM_COMP_ANT_DIV\t\tBIT6\n");
						printk("ODM_COMP_PWR_SAVE\t\tBIT7\n");
						printk("ODM_COMP_PWR_TRAIN\tBIT8\n");
						printk("ODM_COMP_RATE_ADAPTIVE\tBIT9\n");
						printk("ODM_COMP_PATH_DIV\t\tBIT10\n");
						printk("ODM_COMP_PSD	\tBIT11\n");
						printk("ODM_COMP_DYNAMIC_PRICCA\tBIT12\n");
						printk("ODM_COMP_RXHP\t\tBIT13\n");
						printk("ODM_COMP_EDCA_TURBO\tBIT16\n");
						printk("ODM_COMP_EARLY_MODE\tBIT17\n");
						printk("ODM_COMP_TX_PWR_TRACK\tBIT24\n");
						printk("ODM_COMP_RX_GAIN_TRACK\tBIT25\n");
						printk("ODM_COMP_CALIBRATION\tBIT26\n");
						rtw_hal_get_def_var(padapter, HW_DEF_ODM_DBG_FLAG,&extra_arg);
					}
					else{
						rtw_hal_set_def_var(padapter, HW_DEF_ODM_DBG_FLAG,&extra_arg);
					}
				}
					break;
#ifdef DBG_FIXED_CHAN
				case 0x17:
					{
						struct mlme_ext_priv	*pmlmeext = &(padapter->mlmeextpriv);
						printk("===>  Fixed channel to %d \n",extra_arg);
						pmlmeext->fixed_chan = extra_arg;

					}
					break;
#endif
				case 0x20:
					{
						rtw_hal_get_hwreg(padapter, HW_VAR_READ_LLT_TAB,(u8 *)&extra_arg);
					}
					break;
				case 0x23:
					{
						DBG_8723A("turn %s the bNotifyChannelChange Variable\n",(extra_arg==1)?"on":"off");
						padapter->bNotifyChannelChange = extra_arg;
						break;
					}
				case 0x24:
					{
#ifdef CONFIG_P2P
						DBG_8723A("turn %s the bShowGetP2PState Variable\n",(extra_arg==1)?"on":"off");
						padapter->bShowGetP2PState = extra_arg;
#endif // CONFIG_P2P
						break;
					}
				case 0xaa:
					{
						if(extra_arg> 0x13) extra_arg = 0xFF;
						DBG_8723A("chang data rate to :0x%02x\n",extra_arg);
						padapter->fix_rate = extra_arg;
					}
					break;
				case 0xdd://registers dump , 0 for mac reg,1 for bb reg, 2 for rf reg
					{
						if(extra_arg==0){
							mac_reg_dump(padapter);
						}
						else if(extra_arg==1){
							bb_reg_dump(padapter);
						}
						else if(extra_arg==2){
							rf_reg_dump(padapter);
						}

					}
					break;

				case 0xee://turn on/off dynamic funcs
					{
						u32 odm_flag;

						if(0xf==extra_arg){
							rtw_hal_get_def_var(padapter, HAL_DEF_DBG_DM_FUNC,&odm_flag);
							DBG_8723A(" === DMFlag(0x%08x) === \n",odm_flag);
							DBG_8723A("extra_arg = 0  - disable all dynamic func \n");
							DBG_8723A("extra_arg = 1  - disable DIG- BIT(0)\n");
							DBG_8723A("extra_arg = 2  - disable High power - BIT(1)\n");
							DBG_8723A("extra_arg = 3  - disable tx power tracking - BIT(2)\n");
							DBG_8723A("extra_arg = 4  - disable BT coexistence - BIT(3)\n");
							DBG_8723A("extra_arg = 5  - disable antenna diversity - BIT(4)\n");
							DBG_8723A("extra_arg = 6  - enable all dynamic func \n");
						}
						else{
							/*	extra_arg = 0  - disable all dynamic func
								extra_arg = 1  - disable DIG
								extra_arg = 2  - disable tx power tracking
								extra_arg = 3  - turn on all dynamic func
							*/
							rtw_hal_set_def_var(padapter, HAL_DEF_DBG_DM_FUNC, &(extra_arg));
							rtw_hal_get_def_var(padapter, HAL_DEF_DBG_DM_FUNC,&odm_flag);
							DBG_8723A(" === DMFlag(0x%08x) === \n",odm_flag);
						}
					}
					break;

				case 0xfd:
					rtw_write8(padapter, 0xc50, arg);
					DBG_8723A("wr(0xc50)=0x%x\n", rtw_read8(padapter, 0xc50));
					rtw_write8(padapter, 0xc58, arg);
					DBG_8723A("wr(0xc58)=0x%x\n", rtw_read8(padapter, 0xc58));
					break;
				case 0xfe:
					DBG_8723A("rd(0xc50)=0x%x\n", rtw_read8(padapter, 0xc50));
					DBG_8723A("rd(0xc58)=0x%x\n", rtw_read8(padapter, 0xc58));
					break;
				case 0xff:
					{
						DBG_8723A("dbg(0x210)=0x%x\n", rtw_read32(padapter, 0x210));
						DBG_8723A("dbg(0x608)=0x%x\n", rtw_read32(padapter, 0x608));
						DBG_8723A("dbg(0x280)=0x%x\n", rtw_read32(padapter, 0x280));
						DBG_8723A("dbg(0x284)=0x%x\n", rtw_read32(padapter, 0x284));
						DBG_8723A("dbg(0x288)=0x%x\n", rtw_read32(padapter, 0x288));

						DBG_8723A("dbg(0x664)=0x%x\n", rtw_read32(padapter, 0x664));


						DBG_8723A("\n");

						DBG_8723A("dbg(0x430)=0x%x\n", rtw_read32(padapter, 0x430));
						DBG_8723A("dbg(0x438)=0x%x\n", rtw_read32(padapter, 0x438));

						DBG_8723A("dbg(0x440)=0x%x\n", rtw_read32(padapter, 0x440));

						DBG_8723A("dbg(0x458)=0x%x\n", rtw_read32(padapter, 0x458));

						DBG_8723A("dbg(0x484)=0x%x\n", rtw_read32(padapter, 0x484));
						DBG_8723A("dbg(0x488)=0x%x\n", rtw_read32(padapter, 0x488));

						DBG_8723A("dbg(0x444)=0x%x\n", rtw_read32(padapter, 0x444));
						DBG_8723A("dbg(0x448)=0x%x\n", rtw_read32(padapter, 0x448));
						DBG_8723A("dbg(0x44c)=0x%x\n", rtw_read32(padapter, 0x44c));
						DBG_8723A("dbg(0x450)=0x%x\n", rtw_read32(padapter, 0x450));
					}
					break;
			}
			break;
		default:
			DBG_8723A("error dbg cmd!\n");
			break;
	}


	return ret;

}

static int wpa_set_param(struct net_device *dev, u8 name, u32 value)
{
	uint ret=0;
	u32 flags;
	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);

	switch (name){
	case IEEE_PARAM_WPA_ENABLED:

		padapter->securitypriv.dot11AuthAlgrthm= dot11AuthAlgrthm_8021X; //802.1x

		//ret = ieee80211_wpa_enable(ieee, value);

		switch((value)&0xff)
		{
			case 1 : //WPA
			padapter->securitypriv.ndisauthtype = Ndis802_11AuthModeWPAPSK; //WPA_PSK
			padapter->securitypriv.ndisencryptstatus = Ndis802_11Encryption2Enabled;
				break;
			case 2: //WPA2
			padapter->securitypriv.ndisauthtype = Ndis802_11AuthModeWPA2PSK; //WPA2_PSK
			padapter->securitypriv.ndisencryptstatus = Ndis802_11Encryption3Enabled;
				break;
		}

		RT_TRACE(_module_rtl871x_ioctl_os_c,_drv_info_,("wpa_set_param:padapter->securitypriv.ndisauthtype=%d\n", padapter->securitypriv.ndisauthtype));

		break;

	case IEEE_PARAM_TKIP_COUNTERMEASURES:
		//ieee->tkip_countermeasures=value;
		break;

	case IEEE_PARAM_DROP_UNENCRYPTED:
	{
		/* HACK:
		 *
		 * wpa_supplicant calls set_wpa_enabled when the driver
		 * is loaded and unloaded, regardless of if WPA is being
		 * used.  No other calls are made which can be used to
		 * determine if encryption will be used or not prior to
		 * association being expected.  If encryption is not being
		 * used, drop_unencrypted is set to false, else true -- we
		 * can use this to determine if the CAP_PRIVACY_ON bit should
		 * be set.
		 */

