lwfinger/rtl8723au/os_dep/ioctl_linux.c
//		DBG_8723A("OFFSET\tVALUE(hex)\n");
		sprintf(extra, "\n");
		for (i = 0; i < EFUSE_MAP_SIZE; i += 16)
		{
//			DBG_8723A("0x%02x\t", i);
			sprintf(extra, "%s0x%02x\t", extra, i);
			for (j=0; j<8; j++) {
//				DBG_8723A("%02X ", data[i+j]);
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeEfuseInitMap[i+j]);
			}
//			DBG_8723A("\t");
			sprintf(extra, "%s\t", extra);
			for (; j<16; j++) {
//				DBG_8723A("%02X ", data[i+j]);
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeEfuseInitMap[i+j]);
			}
//			DBG_8723A("\n");
			sprintf(extra,"%s\n",extra);
		}
//		DBG_8723A("\n");
	}
	else if (strcmp(tmp[0], "rmap") == 0)
	{
		if ((tmp[1]==NULL) || (tmp[2]==NULL))
		{
			DBG_8723A("%s: rmap Fail!! Parameters error!\n", __func__);
			err = -EINVAL;
			goto exit;
		}

		// rmap addr cnts
		addr = simple_strtoul(tmp[1], &ptmp, 16);
		DBG_8723A("%s: addr=%x\n", __func__, addr);

		cnts = simple_strtoul(tmp[2], &ptmp, 10);
		if (cnts == 0)
		{
			DBG_8723A("%s: rmap Fail!! cnts error!\n", __func__);
			err = -EINVAL;
			goto exit;
		}
		DBG_8723A("%s: cnts=%d\n", __func__, cnts);

		EFUSE_GetEfuseDefinition(padapter, EFUSE_WIFI, TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, (PVOID)&max_available_size, _FALSE);
		if ((addr + cnts) > max_available_size)
		{
			DBG_8723A("%s: addr(0x%X)+cnts(%d) parameter error!\n", __func__, addr, cnts);
			err = -EINVAL;
			goto exit;
		}

		if (rtw_efuse_map_read(padapter, addr, cnts, data) == _FAIL)
		{
			DBG_8723A("%s: rtw_efuse_map_read error!\n", __func__);
			err = -EFAULT;
			goto exit;
		}

//		DBG_8723A("%s: data={", __func__);
		*extra = 0;
		for (i=0; i<cnts; i++) {
//			DBG_8723A("0x%02x ", data[i]);
			sprintf(extra, "%s0x%02X ", extra, data[i]);
		}
//		DBG_8723A("}\n");
	}
	else if (strcmp(tmp[0], "realraw") == 0)
	{
		addr = 0;
		mapLen = EFUSE_MAX_SIZE;
		if (rtw_efuse_access(padapter, _FALSE, addr, mapLen, rawdata) == _FAIL)
		{
			DBG_8723A("%s: rtw_efuse_access Fail!!\n", __func__);
			err = -EFAULT;
			goto exit;
		}

//		DBG_8723A("%s: realraw={\n", __func__);
		sprintf(extra, "\n");
		for (i=0; i<mapLen; i++)
		{
//			DBG_8723A("%02X", rawdata[i]);
			sprintf(extra, "%s%02X", extra, rawdata[i]);

			if ((i & 0xF) == 0xF) {
//				DBG_8723A("\n");
				sprintf(extra, "%s\n", extra);
			}
			else if ((i & 0x7) == 0x7){
//				DBG_8723A("\t");
				sprintf(extra, "%s\t", extra);
			} else {
//				DBG_8723A(" ");
				sprintf(extra, "%s ", extra);
			}
		}
//		DBG_8723A("}\n");
	}
	else if (strcmp(tmp[0], "mac") == 0)
	{
		#ifdef CONFIG_RTL8192C
		addr = 0x16; // EEPROM_MAC_ADDR
		#endif
		#ifdef CONFIG_RTL8192D
		addr = 0x19;
		#endif
		#ifdef CONFIG_RTL8723A
		#ifdef CONFIG_SDIO_HCI
		addr = EEPROM_MAC_ADDR_8723AS;
		#endif
		#ifdef CONFIG_GSPI_HCI
		addr = EEPROM_MAC_ADDR_8723AS;
		#endif
		#ifdef CONFIG_USB_HCI
		addr = EEPROM_MAC_ADDR_8723AU;
		#endif
		#endif // CONFIG_RTL8723A
		cnts = 6;

		EFUSE_GetEfuseDefinition(padapter, EFUSE_WIFI, TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, (PVOID)&max_available_size, _FALSE);
		if ((addr + cnts) > max_available_size) {
			DBG_8723A("%s: addr(0x%02x)+cnts(%d) parameter error!\n", __func__, addr, cnts);
			err = -EFAULT;
			goto exit;
		}

		if (rtw_efuse_map_read(padapter, addr, cnts, data) == _FAIL)
		{
			DBG_8723A("%s: rtw_efuse_map_read error!\n", __func__);
			err = -EFAULT;
			goto exit;
		}

//		DBG_8723A("%s: MAC address={", __func__);
		*extra = 0;
		for (i=0; i<cnts; i++)
		{
//			DBG_8723A("%02X", data[i]);
			sprintf(extra, "%s%02X", extra, data[i]);
			if (i != (cnts-1))
			{
//				DBG_8723A(":");
				sprintf(extra,"%s:",extra);
			}
		}
//		DBG_8723A("}\n");
	}
	else if (strcmp(tmp[0], "vidpid") == 0)
	{
		#ifdef CONFIG_RTL8192C
		addr = 0x0a; // EEPROM_VID
		#endif
		#ifdef CONFIG_RTL8192D
		addr = 0x0c;
		#endif
		#ifdef CONFIG_RTL8723A
		addr = EEPROM_VID_8723AU;
		#endif
		cnts = 4;

		EFUSE_GetEfuseDefinition(padapter, EFUSE_WIFI, TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, (PVOID)&max_available_size, _FALSE);
		if ((addr + cnts) > max_available_size)
		{
			DBG_8723A("%s: addr(0x%02x)+cnts(%d) parameter error!\n", __func__, addr, cnts);
			err = -EFAULT;
			goto exit;
		}
		if (rtw_efuse_map_read(padapter, addr, cnts, data) == _FAIL)
		{
			DBG_8723A("%s: rtw_efuse_access error!!\n", __func__);
			err = -EFAULT;
			goto exit;
		}

//		DBG_8723A("%s: {VID,PID}={", __func__);
		*extra = 0;
		for (i=0; i<cnts; i++)
		{
//			DBG_8723A("0x%02x", data[i]);
			sprintf(extra, "%s0x%02X", extra, data[i]);
			if (i != (cnts-1))
			{
//				DBG_8723A(",");
				sprintf(extra,"%s,",extra);
			}
		}
//		DBG_8723A("}\n");
	}
	else if (strcmp(tmp[0], "ableraw") == 0)
	{
		efuse_GetCurrentSize(padapter,&raw_cursize);
		raw_maxsize = efuse_GetMaxSize(padapter);
		sprintf(extra, "[available raw size]= %d bytes", raw_maxsize-raw_cursize);
	}
	else if (strcmp(tmp[0], "btfmap") == 0)
	{
		mapLen = EFUSE_BT_MAX_MAP_LEN;
		if (rtw_BT_efuse_map_read(padapter, 0, mapLen, pEfuseHal->BTEfuseInitMap) == _FAIL)
		{
			DBG_8723A("%s: rtw_BT_efuse_map_read Fail!!\n", __func__);
			err = -EFAULT;
			goto exit;
		}

//		DBG_8723A("OFFSET\tVALUE(hex)\n");
		sprintf(extra, "\n");
		for (i=0; i<512; i+=16) // set 512 because the iwpriv's extra size have limit 0x7FF
		{
//			DBG_8723A("0x%03x\t", i);
			sprintf(extra, "%s0x%03x\t", extra, i);
			for (j=0; j<8; j++) {
//				DBG_8723A("%02X ", pEfuseHal->BTEfuseInitMap[i+j]);
				sprintf(extra, "%s%02X ", extra, pEfuseHal->BTEfuseInitMap[i+j]);
			}
//			DBG_8723A("\t");
			sprintf(extra,"%s\t",extra);
			for (; j<16; j++) {
//				DBG_8723A("%02X ", pEfuseHal->BTEfuseInitMap[i+j]);
				sprintf(extra, "%s%02X ", extra, pEfuseHal->BTEfuseInitMap[i+j]);
			}
//			DBG_8723A("\n");
			sprintf(extra, "%s\n", extra);
		}
//		DBG_8723A("\n");
	}
	else if (strcmp(tmp[0],"btbmap") == 0)
	{
		mapLen = EFUSE_BT_MAX_MAP_LEN;
		if (rtw_BT_efuse_map_read(padapter, 0, mapLen, pEfuseHal->BTEfuseInitMap) == _FAIL)
		{
			DBG_8723A("%s: rtw_BT_efuse_map_read Fail!!\n", __func__);
			err = -EFAULT;
			goto exit;
		}

