lwfinger/rtl8723au/os_dep/ioctl_linux.c
//		DBG_8723A("OFFSET\tVALUE(hex)\n");
		sprintf(extra, "\n");
		for (i=512; i<1024 ; i+=16)
		{
//			DBG_8723A("0x%03x\t", i);
			sprintf(extra, "%s0x%03x\t", extra, i);
			for (j=0; j<8; j++)
			{
//				DBG_8723A("%02X ", data[i+j]);
				sprintf(extra, "%s%02X ", extra, pEfuseHal->BTEfuseInitMap[i+j]);
			}
//			DBG_8723A("\t");
			sprintf(extra,"%s\t",extra);
			for (; j<16; j++) {
//				DBG_8723A("%02X ", data[i+j]);
				sprintf(extra, "%s%02X ", extra, pEfuseHal->BTEfuseInitMap[i+j]);
			}
//			DBG_8723A("\n");
			sprintf(extra, "%s\n", extra);
		}
//		DBG_8723A("\n");
	}
	else if (strcmp(tmp[0],"btrmap") == 0)
	{
		if ((tmp[1]==NULL) || (tmp[2]==NULL))
		{
			err = -EINVAL;
			goto exit;
		}

		// rmap addr cnts
		addr = simple_strtoul(tmp[1], &ptmp, 16);
		DBG_8723A("%s: addr=0x%X\n", __func__, addr);

		cnts = simple_strtoul(tmp[2], &ptmp, 10);
		if (cnts == 0)
		{
			DBG_8723A("%s: btrmap Fail!! cnts error!\n", __func__);
			err = -EINVAL;
			goto exit;
		}
		DBG_8723A("%s: cnts=%d\n", __func__, cnts);

		EFUSE_GetEfuseDefinition(padapter, EFUSE_BT, TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, (PVOID)&max_available_size, _FALSE);
		if ((addr + cnts) > max_available_size)
		{
			DBG_8723A("%s: addr(0x%X)+cnts(%d) parameter error!\n", __func__, addr, cnts);
			err = -EFAULT;
			goto exit;
		}

		if (rtw_BT_efuse_map_read(padapter, addr, cnts, data) == _FAIL)
		{
			DBG_8723A("%s: rtw_BT_efuse_map_read error!!\n", __func__);
			err = -EFAULT;
			goto exit;
		}

		*extra = 0;
//		DBG_8723A("%s: bt efuse data={", __func__);
		for (i=0; i<cnts; i++)
		{
//			DBG_8723A("0x%02x ", data[i]);
			sprintf(extra, "%s 0x%02X ", extra, data[i]);
		}
//		DBG_8723A("}\n");
	}
	else if (strcmp(tmp[0], "btffake") == 0)
	{
//		DBG_8723A("OFFSET\tVALUE(hex)\n");
		sprintf(extra, "\n");
		for (i=0; i<512; i+=16)
		{
//			DBG_8723A("0x%03x\t", i);
			sprintf(extra, "%s0x%03x\t", extra, i);
			for (j=0; j<8; j++) {
//				DBG_8723A("%02X ", pEfuseHal->fakeBTEfuseModifiedMap[i+j]);
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeBTEfuseModifiedMap[i+j]);
			}
//			DBG_8723A("\t");
			sprintf(extra, "%s\t", extra);
			for (; j<16; j++) {
//				DBG_8723A("%02X ", pEfuseHal->fakeBTEfuseModifiedMap[i+j]);
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeBTEfuseModifiedMap[i+j]);
			}
//			DBG_8723A("\n");
			sprintf(extra, "%s\n", extra);
		}
//		DBG_8723A("\n");
	}
	else if (strcmp(tmp[0],"btbfake") == 0)
	{
//		DBG_8723A("OFFSET\tVALUE(hex)\n");
		sprintf(extra, "\n");
		for (i=512; i<1024; i+=16)
		{
//			DBG_8723A("0x%03x\t", i);
			sprintf(extra, "%s0x%03x\t", extra, i);
			for (j=0; j<8; j++) {
//				DBG_8723A("%02X ", pEfuseHal->fakeBTEfuseModifiedMap[i+j]);
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeBTEfuseModifiedMap[i+j]);
			}
//			DBG_8723A("\t");
			sprintf(extra, "%s\t", extra);
			for (; j<16; j++) {
//				DBG_8723A("%02X ", pEfuseHal->fakeBTEfuseModifiedMap[i+j]);
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeBTEfuseModifiedMap[i+j]);
			}
//			DBG_8723A("\n");
			sprintf(extra, "%s\n", extra);
		}
//		DBG_8723A("\n");
	}
	else if (strcmp(tmp[0],"wlrfkmap")== 0)
	{
//		DBG_8723A("OFFSET\tVALUE(hex)\n");
		sprintf(extra, "\n");
		for (i=0; i<EFUSE_MAP_SIZE; i+=16)
		{
//			DBG_8723A("\t0x%02x\t", i);
			sprintf(extra, "%s0x%02x\t", extra, i);
			for (j=0; j<8; j++) {
//				DBG_8723A("%02X ", pEfuseHal->fakeEfuseModifiedMap[i+j]);
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeEfuseModifiedMap[i+j]);
			}
//			DBG_8723A("\t");
			sprintf(extra, "%s\t", extra);
			for (; j<16; j++) {
//				DBG_8723A("%02X ", pEfuseHal->fakeEfuseModifiedMap[i+j]);
				sprintf(extra, "%s %02X", extra, pEfuseHal->fakeEfuseModifiedMap[i+j]);
			}
//			DBG_8723A("\n");
			sprintf(extra, "%s\n", extra);
		}
//		DBG_8723A("\n");

	}
	else if (strcmp(tmp[0],"wlrfkrmap")== 0)
	{
		if ((tmp[1]==NULL) || (tmp[2]==NULL))
				{
					DBG_8723A("%s: rmap Fail!! Parameters error!\n", __func__);
					err = -EINVAL;
					goto exit;
				}
				// rmap addr cnts
				addr = simple_strtoul(tmp[1], &ptmp, 16);
				DBG_8723A("%s: addr=%x\n", __func__, addr);

				cnts = simple_strtoul(tmp[2], &ptmp, 10);
				if (cnts == 0)
				{
					DBG_8723A("%s: rmap Fail!! cnts error!\n", __func__);
					err = -EINVAL;
					goto exit;
				}
				DBG_8723A("%s: cnts=%d\n", __func__, cnts);

		//		DBG_8723A("%s: data={", __func__);
			*extra = 0;
			for (i=0; i<cnts; i++) {
					DBG_8723A("wlrfkrmap = 0x%02x \n", pEfuseHal->fakeEfuseModifiedMap[addr+i]);
					sprintf(extra, "%s0x%02X ", extra, pEfuseHal->fakeEfuseModifiedMap[addr+i]);
			}
	}
	else if (strcmp(tmp[0],"btrfkrmap")== 0)
	{
		if ((tmp[1]==NULL) || (tmp[2]==NULL))
				{
					DBG_8723A("%s: rmap Fail!! Parameters error!\n", __func__);
					err = -EINVAL;
					goto exit;
				}
				// rmap addr cnts
				addr = simple_strtoul(tmp[1], &ptmp, 16);
				DBG_8723A("%s: addr=%x\n", __func__, addr);

				cnts = simple_strtoul(tmp[2], &ptmp, 10);
				if (cnts == 0)
				{
					DBG_8723A("%s: rmap Fail!! cnts error!\n", __func__);
					err = -EINVAL;
					goto exit;
				}
				DBG_8723A("%s: cnts=%d\n", __func__, cnts);

		//		DBG_8723A("%s: data={", __func__);
			*extra = 0;
			for (i=0; i<cnts; i++) {
					DBG_8723A("wlrfkrmap = 0x%02x \n", pEfuseHal->fakeBTEfuseModifiedMap[addr+i]);
					sprintf(extra, "%s0x%02X ", extra, pEfuseHal->fakeBTEfuseModifiedMap[addr+i]);
			}
	}
	else
	{
		 sprintf(extra, "Command not found!");
	}

exit:
	if (data)
		_rtw_mfree(data, EFUSE_BT_MAX_MAP_LEN);
	if (rawdata)
		_rtw_mfree(rawdata, EFUSE_BT_MAX_MAP_LEN);
	if (!err)
		wrqu->length = strlen(extra);

	#ifdef CONFIG_IPS
	rtw_pm_set_ips(padapter, ips_mode);
	#endif
	#ifdef CONFIG_LPS
	rtw_pm_set_lps(padapter, lps_mode);
	#endif
	#ifdef CONFIG_IOL
	padapter->registrypriv.fw_iol = org_fw_iol;// 0:Disable, 1:enable, 2:by usb speed
	#endif
	return err;
}

static int rtw_mp_efuse_set(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wdata, char *extra)
{
	struct iw_point *wrqu;
	PADAPTER padapter;
	struct pwrctrl_priv *pwrctrlpriv ;
	PHAL_DATA_TYPE pHalData;
	PEFUSE_HAL pEfuseHal;

