lwfinger/rtl8723au/os_dep/ioctl_linux.c
/*
 * Input Format: %s,%d
 *	%s is width, could be
 *		"b" for 1 byte
 *		"w" for WORD (2 bytes)
 *		"dw" for DWORD (4 bytes)
 *	%d is address(offset)
 *
 * Return:
 *	%d for data readed
 */
static int rtw_mp_read_reg(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	char	*input = kmalloc(wrqu->length, GFP_KERNEL);
	char *pch, *pnext, *ptmp;
	char *width_str;
	char width;
	char data[20],tmp[20];
	u32 addr;
	//u32 *data = (u32*)extra;
	u32 ret, i=0, j=0, strtout=0;
	PADAPTER padapter = rtw_netdev_priv(dev);


	if (!input)
		return -ENOMEM;
	if (wrqu->length > 128) {
		kfree(input);
		return -EFAULT;
	}

	if (copy_from_user(input, wrqu->pointer, wrqu->length)) {
		kfree(input);
		return -EFAULT;
	}

	_rtw_memset(data, 0, 20);
	_rtw_memset(tmp, 0, 20);
	_rtw_memset(extra, 0, wrqu->length);

	pch = input;
	pnext = strpbrk(pch, " ,.-");
	if (pnext == NULL) {
		kfree(input);
		return -EINVAL;
	}
	*pnext = 0;
	width_str = pch;

	pch = pnext + 1;
	if ((pch - input) >= wrqu->length) {
		kfree(input);
		return -EINVAL;
	}

	addr = simple_strtoul(pch, &ptmp, 16);
	if (addr > 0x3FFF) {
		kfree(input);
		return -EINVAL;
	}

	ret = 0;
	width = width_str[0];
	switch (width) {
	case 'b':
		// 1 byte
		// *(u8*)data = rtw_read8(padapter, addr);
		sprintf(extra, "%d\n",  rtw_read8(padapter, addr));
		wrqu->length = strlen(extra);
		break;
	case 'w':
		// 2 bytes
		//*(u16*)data = rtw_read16(padapter, addr);
		sprintf(data, "%04x\n", rtw_read16(padapter, addr));
		for( i=0 ; i <= strlen(data) ; i++) {
			if( i%2==0 ) {
				tmp[j]=' ';
				j++;
			}
			if ( data[i] != '\0' )
				tmp[j] = data[i];

				j++;
			}
			pch = tmp;
			DBG_8723A("pch=%s",pch);

			while (*pch != '\0') {
				pnext = strpbrk(pch, " ");
				if (!pnext)
					break;

				pnext++;
				if ( *pnext != '\0' ) {
					  strtout = simple_strtoul (pnext , &ptmp, 16);
					  sprintf( extra, "%s %d" ,extra ,strtout );
				} else {
					  break;
				}
				pch = pnext;
			}
		wrqu->length = 7;
		break;
	case 'd':
		// 4 bytes
		//*data = rtw_read32(padapter, addr);
		sprintf(data, "%08x", rtw_read32(padapter, addr));
			//add read data format blank
		for( i=0 ; i <= strlen(data) ; i++) {
			  if( i%2==0 ) {
				   tmp[j]=' ';
				   j++;
			  }
			  if ( data[i] != '\0' )
				  tmp[j] = data[i];

			  j++;
		}
		pch = tmp;
		DBG_8723A("pch=%s",pch);

		while( *pch != '\0' ) {
			pnext = strpbrk(pch, " ");
			if (!pnext)
				break;

			pnext++;
			if ( *pnext != '\0' ) {
				  strtout = simple_strtoul (pnext , &ptmp, 16);
				  sprintf( extra, "%s %d" ,extra ,strtout );
			} else{
				break;
			}
			pch = pnext;
		}
		wrqu->length = strlen(extra);
		break;
	default:
		wrqu->length = 0;
		ret = -EINVAL;
		break;
	}

	kfree(input);
	return ret;
}

/*
 * Input Format: %d,%x,%x
 *	%d is RF path, should be smaller than MAX_RF_PATH_NUMS
 *	1st %x is address(offset)
 *	2st %x is data to write
 */
 static int rtw_mp_write_rf(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
/*static int rtw_mp_write_rf(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
*/
	u32 path, addr, data;
	int ret;
	PADAPTER padapter = rtw_netdev_priv(dev);


	ret = sscanf(extra, "%d,%x,%x", &path, &addr, &data);
	if (ret < 3) return -EINVAL;

	if (path >= MAX_RF_PATH_NUMS) return -EINVAL;
	if (addr > 0xFF) return -EINVAL;
	if (data > 0xFFFFF) return -EINVAL;

	_rtw_memset(extra, 0, wrqu->length);

	write_rfreg(padapter, path, addr, data);

	sprintf(extra, "write_rf completed \n");
	wrqu->length = strlen(extra);

	return 0;
}

/*
 * Input Format: %d,%x
 *	%d is RF path, should be smaller than MAX_RF_PATH_NUMS
 *	%x is address(offset)
 *
 * Return:
 *	%d for data readed
 */
static int rtw_mp_read_rf(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	char	*input = kmalloc(wrqu->length, GFP_KERNEL);
	char *pch, *pnext, *ptmp;
	char data[20],tmp[20];
	//u32 *data = (u32*)extra;
	u32 path, addr;
	u32 ret,i=0 ,j=0,strtou=0;
	PADAPTER padapter = rtw_netdev_priv(dev);


	if (!input)
		return -ENOMEM;
	if (wrqu->length > 128) {
		kfree(input);
		return -EFAULT;
	}
	if (copy_from_user(input, wrqu->pointer, wrqu->length)) {
		kfree(input);
		return -EFAULT;
	}

	ret = sscanf(input, "%d,%x", &path, &addr);
	if (ret < 2) {
		kfree(input);
		return -EINVAL;
	}

	if (path >= MAX_RF_PATH_NUMS) {
		kfree(input);
		return -EINVAL;
	}
	if (addr > 0xFF) {
		kfree(input);
		return -EINVAL;
	}

	_rtw_memset(extra, 0, wrqu->length);

	//*data = read_rfreg(padapter, path, addr);
	sprintf(data, "%08x", read_rfreg(padapter, path, addr));
	//add read data format blank
	for( i=0 ; i <= strlen(data) ; i++) {
		  if( i%2==0 ) {
			   tmp[j]=' ';
			   j++;
		  }
		  tmp[j] = data[i];
		  j++;
	}
	pch = tmp;
	DBG_8723A("pch=%s",pch);

	while( *pch != '\0' ) {
		pnext = strpbrk(pch, " ");
		pnext++;
		if ( *pnext != '\0' ) {
			  strtou = simple_strtoul (pnext , &ptmp, 16);
			  sprintf( extra, "%s %d" ,extra ,strtou );
		} else{
			  break;
		}
		pch = pnext;
	}
	wrqu->length = strlen(extra);

	kfree(input);
	return 0;
}

static int rtw_mp_start(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u8 val8;
	PADAPTER padapter = rtw_netdev_priv(dev);

	if(padapter->registrypriv.mp_mode ==0)
	{
		#ifdef CONFIG_RTL8723A
		DBG_8723A("_rtw_mp_xmit_priv for Download BT patch FW\n");
		_rtw_mp_xmit_priv(&padapter->xmitpriv);
		#endif

		padapter->registrypriv.mp_mode =1;

		rtw_pm_set_ips(padapter,IPS_NONE);
		LeaveAllPowerSaveMode(padapter);

		MPT_InitializeAdapter(padapter, 1);
	}

	if (padapter->registrypriv.mp_mode == 0)
		return -EPERM;

	if (padapter->mppriv.mode == MP_OFF) {
		if (mp_start_test(padapter) == _FAIL)
			return -EPERM;
		padapter->mppriv.mode = MP_ON;
	}

	return 0;
}

static int rtw_mp_stop(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);

