lwfinger/rtl8723au/os_dep/ioctl_linux.c
			//DBG_8723A("%s:pkTx %d\n", __func__,bStartTest);
			if (bStartTest == 0)
			{
				pmp_priv->tx.stop = 1;
				pmp_priv->mode = MP_ON;
				sprintf( extra, "Stop continuous Tx");
			}
			else if (pmp_priv->tx.stop == 1)
			{
				sprintf( extra, "Start continuous DA=ffffffffffff len=1500 count=%u,\n",count);
				//DBG_8723A("%s:countPkTx %d\n", __func__,count);
				pmp_priv->tx.stop = 0;
				pmp_priv->tx.count = count;
				pmp_priv->tx.payload = 2;
				pattrib = &pmp_priv->tx.attrib;
				pattrib->pktlen = 1500;
				_rtw_memset(pattrib->dst, 0xFF, ETH_ALEN);
				SetPacketTx(padapter);
			}
			else {
				//DBG_8723A("%s: pkTx not stop\n", __func__);
				return -EFAULT;
			}
				wrqu->length = strlen(extra);
				return 0;

		case MP_SINGLE_TONE_TX:
			//DBG_8723A("%s: sgleTx %d \n", __func__, bStartTest);
			if (bStartTest != 0){
				sprintf( extra, "Start continuous DA=ffffffffffff len=1500 \n infinite=yes.");
            }
				Hal_SetSingleToneTx(padapter, (u8)bStartTest);
			break;

		case MP_CONTINUOUS_TX:
			//DBG_8723A("%s: cotuTx %d\n", __func__, bStartTest);
			if (bStartTest != 0){
				sprintf( extra, "Start continuous DA=ffffffffffff len=1500 \n infinite=yes.");
			 }
			  Hal_SetContinuousTx(padapter, (u8)bStartTest);
			break;

		case MP_CARRIER_SUPPRISSION_TX:
			//DBG_8723A("%s: CarrSprTx %d\n", __func__, bStartTest);
			if (bStartTest != 0){
				if( pmp_priv->rateidx <= MPT_RATE_11M )
				{
					sprintf( extra, "Start continuous DA=ffffffffffff len=1500 \n infinite=yes.");
					Hal_SetCarrierSuppressionTx(padapter, (u8)bStartTest);
				}else
					sprintf( extra, "Specify carrier suppression but not CCK rate");
			}
			break;

		case MP_SINGLE_CARRIER_TX:
			//DBG_8723A("%s: scTx %d\n", __func__, bStartTest);
			if (bStartTest != 0){
				sprintf( extra, "Start continuous DA=ffffffffffff len=1500 \n infinite=yes.");
			}
				Hal_SetSingleCarrierTx(padapter, (u8)bStartTest);
			break;

		default:
			//DBG_8723A("%s:No Match MP_MODE\n", __func__);
			sprintf( extra, "Error! Continuous-Tx is not on-going.");
			return -EFAULT;
	}

	if ( bStartTest==1 && pmp_priv->mode != MP_ON) {
		struct mp_priv *pmp_priv = &padapter->mppriv;
		if (pmp_priv->tx.stop == 0) {
			pmp_priv->tx.stop = 1;
			//DBG_8723A("%s: pkt tx is running...\n", __func__);
			rtw_msleep_os(5);
		}
		pmp_priv->tx.stop = 0;
		pmp_priv->tx.count = 1;
		SetPacketTx(padapter);
	} else {
		pmp_priv->mode = MP_ON;
	}

	wrqu->length = strlen(extra);
	return 0;
}


static int rtw_mp_disable_bt_coexist(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
{
	PADAPTER padapter = (PADAPTER)rtw_netdev_priv(dev);
	char	*input = kmalloc(wrqu->data.length, GFP_KERNEL);
	u32 bt_coexist;

#ifdef CONFIG_BT_COEXIST
	PBT30Info		pBTInfo;
	PBT_MGNT		pBtMgnt;

	pBTInfo = GET_BT_INFO(padapter);
	pBtMgnt = &pBTInfo->BtMgnt;
#endif
	if (!input)
		return -ENOMEM;
	if (copy_from_user(input, wrqu->data.pointer, wrqu->data.length)) {
		kfree(input);
		return -EFAULT;
	}

	bt_coexist = rtw_atoi(input);

	if( bt_coexist == 0 )
	{
		RT_TRACE(_module_mp_, _drv_info_,
			("Set OID_RT_SET_DISABLE_BT_COEXIST: disable BT_COEXIST\n"));
#ifdef CONFIG_BT_COEXIST
		pBtMgnt->ExtConfig.bManualControl = _TRUE;
		// Force to switch Antenna to WiFi
		rtw_write16(padapter, 0x870, 0x300);
		rtw_write16(padapter, 0x860, 0x110);
#endif
		//BT_SetManualControl(pAdapter, TRUE);
	}
	else
	{
		RT_TRACE(_module_mp_, _drv_info_,
			("Set OID_RT_SET_DISABLE_BT_COEXIST: enable BT_COEXIST\n"));
#ifdef CONFIG_BT_COEXIST
		pBtMgnt->ExtConfig.bManualControl = _FALSE;
#endif
		//BT_SetManualControl(pAdapter, FALSE);
	}

	kfree(input);
	return 0;
}


static int rtw_mp_arx(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u8 bStartRx=0,bStopRx=0,bQueryPhy=0,bQueryMac=0;
	u32 cckok=0,cckcrc=0,ofdmok=0,ofdmcrc=0,htok=0,htcrc=0,OFDM_FA=0,CCK_FA=0,DropPacket=0;
	char	*input = kmalloc(wrqu->length, GFP_KERNEL);
	PADAPTER padapter = rtw_netdev_priv(dev);

	if (!input)
		return -ENOMEM;
	if (copy_from_user(input, wrqu->pointer, wrqu->length)) {
		kfree(input);
		return -EFAULT;
	}

	DBG_8723A("%s: %s\n", __func__, input);

	bStartRx = (strncmp(input, "start", 5)==0)?1:0; // strncmp TRUE is 0
	bStopRx = (strncmp(input, "stop", 5)==0)?1:0; // strncmp TRUE is 0
	bQueryPhy = (strncmp(input, "phy", 3)==0)?1:0; // strncmp TRUE is 0
	bQueryMac = (strncmp(input, "mac", 3)==0)?1:0; // strncmp TRUE is 0

	if(bStartRx)
	{
		sprintf( extra, "start");
		SetPacketRx(padapter, bStartRx);
	}
	else if(bStopRx)
	{
		SetPacketRx(padapter, 0);
		sprintf( extra, "Received packet OK:%d CRC error:%d",padapter->mppriv.rx_pktcount,padapter->mppriv.rx_crcerrpktcount);
	}
	else if(bQueryPhy)
	{
		/*
		OFDM FA
		RegCF0[15:0]
		RegCF2[31:16]
		RegDA0[31:16]
		RegDA4[15:0]
		RegDA4[31:16]
		RegDA8[15:0]
		CCK FA
		(RegA5B<<8) | RegA5C
		*/
		cckok = read_bbreg(padapter, 0xf88, 0xffffffff );
		cckcrc = read_bbreg(padapter, 0xf84, 0xffffffff );
		ofdmok = read_bbreg(padapter, 0xf94, 0x0000FFFF );
		ofdmcrc = read_bbreg(padapter, 0xf94 , 0xFFFF0000 );
		htok = read_bbreg(padapter, 0xf90, 0x0000FFFF );
		htcrc = read_bbreg(padapter,0xf90, 0xFFFF0000 );

		OFDM_FA=+read_bbreg(padapter, 0xcf0, 0x0000FFFF );
		OFDM_FA=+read_bbreg(padapter, 0xcf2, 0xFFFF0000 );
		OFDM_FA=+read_bbreg(padapter, 0xda0, 0xFFFF0000 );
		OFDM_FA=+read_bbreg(padapter, 0xda4, 0x0000FFFF );
		OFDM_FA=+read_bbreg(padapter, 0xda4, 0xFFFF0000 );
		OFDM_FA=+read_bbreg(padapter, 0xda8, 0x0000FFFF );
		CCK_FA=(rtw_read8(padapter, 0xa5b )<<8 ) | (rtw_read8(padapter, 0xa5c));

		sprintf( extra, "Phy Received packet OK:%d CRC error:%d FA Counter: %d",cckok+ofdmok+htok,cckcrc+ofdmcrc+htcrc,OFDM_FA+CCK_FA);
	}
	else if(bQueryMac)
	{
		//OFDM
		rtw_write32(padapter, 0x664, (rtw_read32(padapter, 0x0664)& 0x0FFFFFFF)| Mac_OFDM_OK);
		ofdmok = rtw_read32(padapter, 0x664)& 0x0000FFFF; //[15:0]	R/W 0	BIT_RPT_COUNTER
		rtw_write32(padapter, 0x664, (rtw_read32(padapter, 0x0664)& 0x0FFFFFFF)| Mac_OFDM_Fail);
		ofdmcrc = rtw_read32(padapter, 0x664)& 0x0000FFFF;
		rtw_write32(padapter, 0x664, (rtw_read32(padapter, 0x0664)& 0x0FFFFFFF)| Mac_OFDM_FasleAlarm);
		OFDM_FA = rtw_read32(padapter, 0x664)& 0x0000FFFF;
		//CCK
		rtw_write32(padapter, 0x664, (rtw_read32(padapter, 0x0664)& 0x0FFFFFFF)|Mac_CCK_OK);
		cckok = rtw_read32(padapter, 0x664)& 0x0000FFFF;
		rtw_write32(padapter, 0x664, (rtw_read32(padapter, 0x0664)& 0x0FFFFFFF)| Mac_CCK_Fail);
		cckcrc = rtw_read32(padapter, 0x664)& 0x0000FFFF;
		rtw_write32(padapter, 0x664, (rtw_read32(padapter, 0x0664)& 0x0FFFFFFF)| Mac_CCK_FasleAlarm);
		CCK_FA = rtw_read32(padapter, 0x664)& 0x0000FFFF;
		//HT
		rtw_write32(padapter, 0x664, (rtw_read32(padapter, 0x0664)& 0x0FFFFFFF)| Mac_HT_OK);
		htok = rtw_read32(padapter, 0x664)& 0x0000FFFF;
		rtw_write32(padapter, 0x664, (rtw_read32(padapter, 0x0664)& 0x0FFFFFFF)| Mac_HT_Fail);
		htcrc = rtw_read32(padapter, 0x664)& 0x0000FFFF;
		rtw_write32(padapter, 0x664, (rtw_read32(padapter, 0x0664)& 0x0FFFFFFF)|Mac_HT_FasleAlarm);
		OFDM_FA += rtw_read32(padapter, 0x664)& 0x0000FFFF;
		//Mac_DropPacket
		rtw_write32(padapter, 0x664, (rtw_read32(padapter, 0x0664)& 0x0FFFFFFF)| Mac_DropPacket);
		DropPacket = rtw_read32(padapter, 0x664)& 0x0000FFFF;

		sprintf( extra, "Mac Received packet OK: %d , CRC error: %d , FA Counter: %d , Drop Packets: %d\n",cckok+ofdmok+htok,cckcrc+ofdmcrc+htcrc,OFDM_FA+CCK_FA,DropPacket);
	}
	wrqu->length = strlen(extra) + 1;
	kfree(input);
	return 0;
}

