lwfinger/rtl8723au/os_dep/ioctl_linux.c
static int rtw_mp_trx_query(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u32 txok,txfail,rxok,rxfail;
	PADAPTER padapter = rtw_netdev_priv(dev);
	//if (copy_from_user(extra, wrqu->data.pointer, wrqu->data.length))
	//	return -EFAULT;

	txok=padapter->mppriv.tx.sended;
	txfail=0;
	rxok = padapter->mppriv.rx_pktcount;
	rxfail = padapter->mppriv.rx_crcerrpktcount;

	_rtw_memset(extra, '\0', 128);

	sprintf(extra, "Tx OK:%d, Tx Fail:%d, Rx OK:%d, CRC error:%d ", txok, txfail,rxok,rxfail);

	wrqu->length=strlen(extra)+1;

	return 0;
}

static int rtw_mp_pwrtrk(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u8 enable;
	u32 thermal;
	s32 ret;
	PADAPTER padapter = rtw_netdev_priv(dev);
	char	*input = kmalloc(wrqu->length, GFP_KERNEL);

	if (!input)
		return -ENOMEM;
	if (copy_from_user(input, wrqu->pointer, wrqu->length)) {
		kfree(input);
		return -EFAULT;
	}

	_rtw_memset(extra, 0, wrqu->length);

	enable = 1;
	if (wrqu->length > 1) { // not empty string
		if (strncmp(input, "stop", 4) == 0) {
			enable = 0;
			sprintf(extra, "mp tx power tracking stop");
		} else if (sscanf(input, "ther=%d", &thermal)) {
				ret = Hal_SetThermalMeter(padapter, (u8)thermal);
				if (ret == _FAIL) return -EPERM;
				sprintf(extra, "mp tx power tracking start,target value=%d ok ",thermal);
		} else {
			kfree(input);
			return -EINVAL;
		}
	}

	ret = Hal_SetPowerTracking(padapter, enable);
	if (ret == _FAIL){
		kfree(input);
		return -EPERM;
	}

	wrqu->length = strlen(extra);
	kfree(input);
	return 0;
}

static int rtw_mp_psd(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	u8 *input = kmalloc(wrqu->length, GFP_KERNEL);

	if (!input)
		return -ENOMEM;
	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;

	strcpy(extra,input);

	wrqu->length = mp_query_psd(padapter, extra);
	kfree(input);
	return 0;
}

static int rtw_mp_thermal(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u8 val;
	u16 bwrite=1;

	#if defined(CONFIG_RTL8192C) || defined(CONFIG_RTL8192D)
			u16 addr=EEPROM_THERMAL_METER;
	#endif
	#ifdef CONFIG_RTL8723A
			u16 addr=EEPROM_THERMAL_METER_8723A;
	#endif
	#if defined(CONFIG_RTL8188E)
			u16 addr=EEPROM_THERMAL_METER_88E;
	#endif

	u16 cnt=1;
	u16 max_available_size=0;
	PADAPTER padapter = rtw_netdev_priv(dev);

	if (copy_from_user(extra, wrqu->pointer, wrqu->length))
		return -EFAULT;

	//DBG_8723A("print extra %s \n",extra);

	 bwrite = strncmp(extra, "write", 6); // strncmp TRUE is 0

	 Hal_GetThermalMeter(padapter, &val);

	 if( bwrite == 0 )
	 {
		 //DBG_8723A("to write val:%d",val);
			EFUSE_GetEfuseDefinition(padapter, EFUSE_WIFI, TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, (PVOID)&max_available_size, _FALSE);
			if( 2 > max_available_size )
			{
				DBG_8723A("no available efuse!\n");
				return -EFAULT;
			}
			if ( rtw_efuse_map_write(padapter, addr, cnt, &val) == _FAIL )
			{
				DBG_8723A("rtw_efuse_map_write error \n");
				return -EFAULT;
			}
			else
			{
				 sprintf(extra, " efuse write ok :%d", val);
			}
	  }
	  else
	  {
			 sprintf(extra, "%d", val);
	  }
	wrqu->length = strlen(extra);

	return 0;
}

static int rtw_mp_reset_stats(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	struct mp_priv *pmp_priv;
	struct pkt_attrib *pattrib;
	PADAPTER padapter = rtw_netdev_priv(dev);

	pmp_priv = &padapter->mppriv;

	pmp_priv->tx.sended = 0;
	pmp_priv->tx_pktcount = 0;
	pmp_priv->rx_pktcount = 0;
	pmp_priv->rx_crcerrpktcount = 0;

	//reset phy counter
	write_bbreg(padapter,0xf14,BIT16,0x1);
	rtw_msleep_os(10);
	write_bbreg(padapter,0xf14,BIT16,0x0);

	return 0;
}

static int rtw_mp_dump(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	struct mp_priv *pmp_priv;
	struct pkt_attrib *pattrib;
        u32 value;
	u8 rf_type,path_nums = 0;
	u32 i,j=1,path;
	PADAPTER padapter = rtw_netdev_priv(dev);

	pmp_priv = &padapter->mppriv;


	//if (copy_from_user(extra, wrqu->data.pointer, wrqu->data.length))
	//	return -EFAULT;

	if ( strncmp(extra, "all", 4)==0 )
	{
			DBG_8723A("\n======= MAC REG =======\n");
			for ( i=0x0;i<0x300;i+=4 )
			{
				if(j%4==1)	DBG_8723A("0x%02x",i);
				DBG_8723A(" 0x%08x ",rtw_read32(padapter,i));
				if((j++)%4 == 0)	DBG_8723A("\n");
			}
			for( i=0x400;i<0x1000;i+=4 )
			{
				if(j%4==1)	DBG_8723A("0x%02x",i);
				DBG_8723A(" 0x%08x ",rtw_read32(padapter,i));
				if((j++)%4 == 0)	DBG_8723A("\n");
			}

			i,j=1;
			rtw_hal_get_hwreg(padapter, HW_VAR_RF_TYPE, (u8 *)(&rf_type));

			DBG_8723A("\n======= RF REG =======\n");
			if(( RF_1T2R == rf_type ) ||( RF_1T1R ==rf_type ))
				path_nums = 1;
			else
				path_nums = 2;

			for(path=0;path<path_nums;path++)
			{
#ifdef CONFIG_RTL8192D
			  for (i = 0; i < 0x50; i++)
#else
			 for (i = 0; i < 0x34; i++)
#endif
				{
					//value = PHY_QueryRFReg(padapter, (RF_RADIO_PATH_E)path,i, bMaskDWord);
					value = rtw_hal_read_rfreg(padapter, path, i, 0xffffffff);
					if(j%4==1)	DBG_8723A("0x%02x ",i);
					DBG_8723A(" 0x%08x ",value);
					if((j++)%4==0)	DBG_8723A("\n");
				}
			}
	}
	return 0;
}

static int rtw_mp_phypara(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{

	PADAPTER padapter = rtw_netdev_priv(dev);
	char	*input = kmalloc(wrqu->length, GFP_KERNEL);
	u32	valxcap;

	if (!input)
		return -ENOMEM;
	if (copy_from_user(input, wrqu->pointer, wrqu->length)) {
		kfree(input);
		return -EFAULT;
	}

	DBG_8723A("%s:iwpriv in=%s\n", __func__, input);

	sscanf(input, "xcap=%d", &valxcap);

	Hal_ProSetCrystalCap( padapter , valxcap );

	sprintf( extra, "Set xcap=%d",valxcap );
	wrqu->length = strlen(extra) + 1;

	kfree(input);
	return 0;
}

static int rtw_mp_SetRFPath(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char	*input = kmalloc(wrqu->data.length, GFP_KERNEL);
	u8	bMain=1,bTurnoff=1;

	if (!input)
		return -ENOMEM;
	if (copy_from_user(input, wrqu->data.pointer, wrqu->data.length)) {
		kfree(input);
		return -EFAULT;
	}
	DBG_8723A("%s:iwpriv in=%s\n", __func__, input);

	bMain = strncmp(input, "1", 2); // strncmp TRUE is 0
	bTurnoff = strncmp(input, "0", 3); // strncmp TRUE is 0

	if(bMain==0) {
		MP_PHY_SetRFPathSwitch(padapter,_TRUE);
		DBG_8723A("%s:PHY_SetRFPathSwitch=TRUE\n", __func__);
	} else if(bTurnoff==0) {
		MP_PHY_SetRFPathSwitch(padapter,_FALSE);
		DBG_8723A("%s:PHY_SetRFPathSwitch=FALSE\n", __func__);
	}

	kfree(input);
	return 0;
}

static int rtw_mp_QueryDrv(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char	*input = kmalloc(wrqu->data.length, GFP_KERNEL);
	u8	qAutoLoad=1;
	EEPROM_EFUSE_PRIV *pEEPROM = GET_EEPROM_EFUSE_PRIV(padapter);

	if (!input)
		return -ENOMEM;
	if (copy_from_user(input, wrqu->data.pointer, wrqu->data.length)) {
		kfree(input);
		return -EFAULT;
	}
	DBG_8723A("%s:iwpriv in=%s\n", __func__, input);

	qAutoLoad = strncmp(input, "autoload", 8); // strncmp TRUE is 0

	if(qAutoLoad==0) {
		DBG_8723A("%s:qAutoLoad\n", __func__);

