lwfinger/rtl8723au/os_dep/ioctl_linux.c
		if(pEEPROM->bautoload_fail_flag)
			sprintf(extra, "fail");
		else
			sprintf(extra, "ok");
	}
	wrqu->data.length = strlen(extra) + 1;
	kfree(input);
	return 0;
}

/* update Tx AGC offset */
static int rtw_mp_antBdiff(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{


	// MPT_ProSetTxAGCOffset
	return 0;
}


static int rtw_mp_PwrCtlDM(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char	*input = kmalloc(wrqu->length, GFP_KERNEL);
	u8	bstart=1;

	if (!input)
		return -ENOMEM;
	if (copy_from_user(input, wrqu->pointer, wrqu->length)) {
		kfree(input);
		return -EFAULT;
	}

	bstart = strncmp(input, "start", 5); // strncmp TRUE is 0
	if (bstart == 0) {
		sprintf(extra, "PwrCtlDM start \n");
		MPT_PwrCtlDM(padapter,1);
	} else {
		sprintf(extra, "PwrCtlDM stop \n");
		MPT_PwrCtlDM(padapter,0);
	}
	wrqu->length = strlen(extra);

	kfree(input);
	return 0;
}


#ifdef CONFIG_RTL8723A

/* update Tx AGC offset */
static int rtw_mp_SetBT(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	struct hal_ops *pHalFunc = &padapter->HalFunc;

	BT_REQ_CMD	BtReq;
	PMPT_CONTEXT	pMptCtx=&(padapter->mppriv.MptCtx);
	PBT_RSP_CMD	pBtRsp=(PBT_RSP_CMD)&pMptCtx->mptOutBuf[0];
	char	input[128];
	char *pch, *ptmp, *token, *tmp[2]={NULL, NULL};
	u8 setdata[100];
	u8 resetbt=0x00;
	u16 dltime=0;

	u16 testmode=1,ready=1,trxparam=1,setgen=1,getgen=1,testctrl=1,testbt=1;
	u32 i,ii,jj,kk,cnts,status;
	PRT_FIRMWARE_8723A	pBTFirmware = NULL;

	if (copy_from_user(extra, wrqu->data.pointer, wrqu->data.length))
			return -EFAULT;
	if(strlen(extra)<1) return -EFAULT;

	DBG_8723A("%s:iwpriv in=%s\n", __func__, extra);
	ready = strncmp(extra, "ready", 5);
	testmode = strncmp(extra, "testmode", 8); // strncmp TRUE is 0
	trxparam = strncmp(extra, "trxparam", 8);
	setgen = strncmp(extra, "setgen", 6);
	getgen = strncmp(extra, "getgen", 6);
	testctrl = strncmp(extra, "testctrl", 8);
	testbt = strncmp(extra, "testbt", 6);

	if ( strncmp(extra, "dlfw", 4) == 0)
	{

		while(dltime<3)
		{
		//rtw_write32(padapter, 0x6a, (rtw_read32(padapter, 0x6a)| 0x00000002));
		//rtw_msleep_os(1000);
			rtw_write32(padapter, 0xcc, (rtw_read32(padapter, 0xcc)| 0x00000002));
			rtw_write32(padapter, 0x6b, (rtw_read32(padapter, 0x6b)& 0xFFFFFFFB));
			rtw_msleep_os(500);
			rtw_write32(padapter, 0x6a, (rtw_read32(padapter, 0x6a)& 0xFFFFFFFE));
			rtw_msleep_os(500);
			rtw_write32(padapter, 0x6b, (rtw_read32(padapter, 0x6b)| 0x00000004));
			rtw_write32(padapter, 0xcc, (rtw_read32(padapter, 0xcc)& 0xFFFFFFFD));
			rtw_msleep_os(1000);
		#if 0
			FillH2CCmd(padapter, 0x32, 1, &resetbt);
			rtw_msleep_os(1000);
		#endif

		if(padapter->bBTFWReady == _FALSE && padapter->registrypriv.mp_mode == 1)
		{
			//pMptCtx->h2cReqNum=0;
			DBG_8723A("padapter->bBTFWReady == _FALSE rtl8723a_FirmwareDownload  !\n");
			status = rtl8723a_FirmwareDownload(padapter);
		}
		else
		{
			pBTFirmware = (PRT_FIRMWARE_8723A)rtw_zmalloc(sizeof(RT_FIRMWARE_8723A));
			DBG_8723A("rtl8723a_FirmwareDownload go to FirmwareDownloadBT !\n");
			FirmwareDownloadBT(padapter, pBTFirmware);
			if (pBTFirmware)
				rtw_mfree((u8*)pBTFirmware, sizeof(RT_FIRMWARE_8723A));
		}

			rtw_msleep_os(1200);
			_rtw_memset(extra,'\0', wrqu->data.length);
			BtReq.opCodeVer=1;
			BtReq.OpCode=0;
			BtReq.paraLength=0;
			mptbt_BtControlProcess(padapter,&BtReq);

			for (i=4; i<pMptCtx->mptOutLen; i++)
			{
				DBG_8723A("FirmwareDownloadBT ready = 0x%x ", pMptCtx->mptOutBuf[i]);
				if( (pMptCtx->mptOutBuf[i]==0x00) && (pMptCtx->mptOutBuf[i+1]==0x00))
				{
							sprintf(extra, "download FW Fail! retry = %d\n",dltime);
							padapter->bBTFWReady = _FALSE;

				}
				else
				{
							padapter->bBTFWReady = _TRUE;
							sprintf(extra, "download FW OK. \n");
					goto exit;
				}
			}
			dltime++;
		}

		goto exit;
	}

	if ( strncmp(extra, "down", 4) == 0){
		DBG_8723A("SetBT down for to hal_init !\n");
		pHalFunc->hal_init(padapter);
		goto exit;
	}

	if( testbt==0 )
	{
			BtReq.opCodeVer=1;
			BtReq.OpCode=6;
			BtReq.paraLength=cnts/2;
			goto todo;
	}
	if( ready==0 )
	{
		BtReq.opCodeVer=1;
		BtReq.OpCode=0;
		BtReq.paraLength=0;
		goto todo;
	}

	DBG_8723A("%s:after strncmp\n", __func__);
	pch = extra;
	i = 0;
	while ((token = strsep(&pch, ",")) != NULL)
	{
		if (i > 1) break;
		tmp[i] = token;
		i++;
	}

	if ((tmp[0]==NULL) && (tmp[1]==NULL))
	{
		return -EFAULT;
	}
	else
	{
		cnts = strlen(tmp[1]);
		if (cnts<1) return -EFAULT;

		DBG_8723A("%s: cnts=%d\n", __func__, cnts);
		DBG_8723A("%s: data=%s\n", __func__, tmp[1]);

		for (jj=0, kk=0; jj<cnts; jj++, kk+=2)
		{
				BtReq.pParamStart[jj] = key_2char2num(tmp[1][kk], tmp[1][kk+1]);
				DBG_8723A("BtReq.pParamStart[%d]=%x \n",ii,BtReq.pParamStart[jj]);
		}
	}

	if( testmode==0 )
	{
		BtReq.opCodeVer=1;
		BtReq.OpCode=1;
		BtReq.paraLength=1;
	}
	if( trxparam==0 )
	{
		BtReq.opCodeVer=1;
		BtReq.OpCode=2;
		BtReq.paraLength=cnts/2;
	}
	if( setgen==0 )
	{
		DBG_8723A("%s: BT_SET_GENERAL \n", __func__);
		BtReq.opCodeVer=1;
		BtReq.OpCode=3; //BT_SET_GENERAL	3
		BtReq.paraLength=cnts/2;
	}
	if( getgen==0 )
	{
		DBG_8723A("%s: BT_GET_GENERAL \n", __func__);
		BtReq.opCodeVer=1;
		BtReq.OpCode=4;		//BT_GET_GENERAL	4
		BtReq.paraLength=cnts/2;
	}
	if( testctrl==0 )
	{
		DBG_8723A("%s: BT_TEST_CTRL \n", __func__);
		BtReq.opCodeVer=1;
		BtReq.OpCode=5;		//BT_TEST_CTRL	5
		BtReq.paraLength=cnts/2;
	}


	DBG_8723A("%s: BtReq.paraLength =%d\n", __func__, BtReq.paraLength);

	DBG_8723A("opCodeVer=%d,OpCode=%d \n",BtReq.opCodeVer,BtReq.OpCode);

	if(BtReq.paraLength<1)
		goto todo;

	for(i=0;i<BtReq.paraLength;i++)
	{
		DBG_8723A("%s: BtReq.pParamStart[ %d ] = 0x%02x \n", __func__,i,BtReq.pParamStart[i]);
	}

todo:
	_rtw_memset(extra,'\0', wrqu->data.length);

	mptbt_BtControlProcess(padapter,&BtReq);

	for (i=4; i<pMptCtx->mptOutLen; i++)
	{
		DBG_8723A("0x%x ", pMptCtx->mptOutBuf[i]);
		sprintf(extra, "%s 0x%x ", extra, pMptCtx->mptOutBuf[i]);
	}

