lwfinger/rtl8723au/os_dep/ioctl_linux.c
exit:
	wrqu->data.length = strlen(extra) + 1;

return status;

}

#endif //#ifdef CONFIG_RTL8723A

static int rtw_mp_set(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wdata, char *extra)
{
	struct iw_point *wrqu = (struct iw_point *)wdata;
	u32 subcmd = wrqu->flags;
	PADAPTER padapter = rtw_netdev_priv(dev);

	if (padapter == NULL)
	{
		return -ENETDOWN;
	}

	//_rtw_memset(extra, 0x00, IW_PRIV_SIZE_MASK);

	if (extra == NULL)
	{
		wrqu->length = 0;
		return -EIO;
	}

	switch(subcmd)
	{
	case MP_START:
			DBG_8723A("set case mp_start \n");
			rtw_mp_start (dev,info,wrqu,extra);
			 break;

	case MP_STOP:
			DBG_8723A("set case mp_stop \n");
			rtw_mp_stop (dev,info,wrqu,extra);
			 break;

	case MP_BANDWIDTH:
			DBG_8723A("set case mp_bandwidth \n");
			rtw_mp_bandwidth (dev,info,wrqu,extra);
			break;

	case MP_RESET_STATS:
			DBG_8723A("set case MP_RESET_STATS \n");
			rtw_mp_reset_stats	(dev,info,wrqu,extra);
			break;
	case MP_SetRFPathSwh:
			DBG_8723A("set MP_SetRFPathSwitch \n");
			rtw_mp_SetRFPath  (dev,info,wdata,extra);
			break;
	case CTA_TEST:
			DBG_8723A("set CTA_TEST\n");
			rtw_cta_test_start (dev, info, wdata, extra);
			break;
	case MP_DISABLE_BT_COEXIST:
			DBG_8723A("set case MP_DISABLE_BT_COEXIST \n");
			rtw_mp_disable_bt_coexist(dev, info, wdata, extra);
		break;
	}


	return 0;
}


static int rtw_mp_get(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wdata, char *extra)
{
	struct iw_point *wrqu = (struct iw_point *)wdata;
	u32 subcmd = wrqu->flags;
	PADAPTER padapter = rtw_netdev_priv(dev);

	//DBG_8723A("in mp_get extra= %s \n",extra);

	if (padapter == NULL)
	{
		return -ENETDOWN;
	}
	if (extra == NULL)
	{
		wrqu->length = 0;
		return -EIO;
	}

	switch(subcmd)
	{
	case WRITE_REG :
			rtw_mp_write_reg (dev,info,wrqu,extra);
			 break;

	case WRITE_RF:
			rtw_mp_write_rf (dev,info,wrqu,extra);
			 break;

	case MP_PHYPARA:
			DBG_8723A("mp_get  MP_PHYPARA \n");
			rtw_mp_phypara(dev,info,wrqu,extra);
			break;

	case MP_CHANNEL:
			DBG_8723A("set case mp_channel \n");
			rtw_mp_channel (dev,info,wrqu,extra);
			break;

	case READ_REG:
			DBG_8723A("mp_get  READ_REG \n");
			rtw_mp_read_reg (dev,info,wrqu,extra);
			 break;
	case READ_RF:
			DBG_8723A("mp_get  READ_RF \n");
			rtw_mp_read_rf (dev,info,wrqu,extra);
			break;

	case MP_RATE:
			DBG_8723A("set case mp_rate \n");
			rtw_mp_rate (dev,info,wrqu,extra);
			break;

	case MP_TXPOWER:
			DBG_8723A("set case MP_TXPOWER \n");
			rtw_mp_txpower (dev,info,wrqu,extra);
			break;

	case MP_ANT_TX:
			DBG_8723A("set case MP_ANT_TX \n");
			rtw_mp_ant_tx (dev,info,wrqu,extra);
			break;

	case MP_ANT_RX:
			DBG_8723A("set case MP_ANT_RX \n");
			rtw_mp_ant_rx (dev,info,wrqu,extra);
			break;

	case MP_QUERY:
			//DBG_8723A("mp_get mp_query MP_QUERY \n");
			rtw_mp_trx_query(dev,info,wrqu,extra);
			break;

	case MP_CTX:
			DBG_8723A("set case MP_CTX \n");
			rtw_mp_ctx (dev,info,wrqu,extra);
			break;

	case MP_ARX:
			DBG_8723A("set case MP_ARX \n");
			rtw_mp_arx (dev,info,wrqu,extra);
			break;

	case EFUSE_GET:
			DBG_8723A("efuse get EFUSE_GET \n");
			rtw_mp_efuse_get(dev,info,wdata,extra);
		 break;

	case MP_DUMP:
			DBG_8723A("set case MP_DUMP \n");
			rtw_mp_dump (dev,info,wrqu,extra);
		 break;
	case MP_PSD:
			DBG_8723A("set case MP_PSD \n");
			rtw_mp_psd (dev,info,wrqu,extra);
		 break;
	case MP_THER:
			DBG_8723A("set case MP_THER \n");
			rtw_mp_thermal (dev,info,wrqu,extra);
		break;
	case MP_PwrCtlDM:
			DBG_8723A("set MP_PwrCtlDM\n");
			rtw_mp_PwrCtlDM (dev,info,wrqu,extra);
		break;
	case MP_QueryDrvStats:
			DBG_8723A("mp_get MP_QueryDrvStats \n");
			rtw_mp_QueryDrv  (dev,info,wdata,extra);
			break;
		case MP_PWRTRK:
			DBG_8723A("set case MP_PWRTRK \n");
			rtw_mp_pwrtrk (dev,info,wrqu,extra);
			break;
	case EFUSE_SET:
			DBG_8723A("set case efuse set \n");
			rtw_mp_efuse_set (dev,info,wdata,extra);
			break;

#ifdef CONFIG_RTL8723A
	case MP_SetBT:
			DBG_8723A("set MP_SetBT \n");
			rtw_mp_SetBT  (dev,info,wdata,extra);
			break;
#endif

	}

	rtw_msleep_os(10); //delay 5ms for sending pkt before exit adb shell operation
return 0;
}

#endif //#if defined(CONFIG_MP_INCLUDED) && defined(CONFIG_MP_IWPRIV_SUPPORT)

static int rtw_wfd_tdls_enable(struct net_device *dev,
				struct iw_request_info *info,
				union iwreq_data *wrqu, char *extra)
{
	int ret = 0;

#ifdef CONFIG_TDLS
#ifdef CONFIG_WFD

	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);

	printk( "[%s] %s %d\n", __func__, extra, wrqu->data.length -1  );

	if ( extra[ 0 ] == '0' )
	{
		padapter->wdinfo.wfd_tdls_enable = 0;
	}
	else
	{
		padapter->wdinfo.wfd_tdls_enable = 1;
	}

#endif //CONFIG_WFD
#endif //CONFIG_TDLS

	return ret;
}

static int rtw_tdls_weaksec(struct net_device *dev,
				struct iw_request_info *info,
				union iwreq_data *wrqu, char *extra)
{
	int ret = 0;

#ifdef CONFIG_TDLS

	u8 i, j;
	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);

	DBG_8723A( "[%s] %s %d\n", __func__, extra, wrqu->data.length -1  );

	if ( extra[ 0 ] == '0' )
	{
		padapter->wdinfo.wfd_tdls_weaksec = 0;
	}
	else
	{
		padapter->wdinfo.wfd_tdls_weaksec = 1;
	}
#endif

	return ret;
}


static int rtw_tdls_enable(struct net_device *dev,
				struct iw_request_info *info,
				union iwreq_data *wrqu, char *extra)
{
	int ret = 0;

#ifdef CONFIG_TDLS

	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);
	struct tdls_info	*ptdlsinfo = &padapter->tdlsinfo;
	_irqL	 irqL;
	_list	*plist, *phead;
	s32	index;
	struct sta_info *psta = NULL;
	struct	sta_priv *pstapriv = &padapter->stapriv;
	u8 tdls_sta[NUM_STA][ETH_ALEN];
	u8 empty_hwaddr[ETH_ALEN] = { 0x00 };

	printk( "[%s] %s %d\n", __func__, extra, wrqu->data.length -1  );

	_rtw_memset(tdls_sta, 0x00, sizeof(tdls_sta));

	if ( extra[ 0 ] == '0' )
	{
		ptdlsinfo->enable = 0;

		if(pstapriv->asoc_sta_count==1)
			return ret;

		_enter_critical_bh(&pstapriv->sta_hash_lock, &irqL);
		for(index=0; index< NUM_STA; index++)
		{
			phead = &(pstapriv->sta_hash[index]);
			plist = get_next(phead);

			while ((rtw_end_of_queue_search(phead, plist)) == _FALSE)
			{
				psta = LIST_CONTAINOR(plist, struct sta_info ,hash_list);

