lwfinger/rtl8723au/os_dep/ioctl_linux.c
	// disable dynamic algorithm
	{
	u32 DMFlag = DYNAMIC_FUNC_DISABLE;
	rtw_hal_get_hwreg(padapter, HW_VAR_DM_FLAG, (u8*)&DMFlag);
	}

	// create pseudo ad-hoc connection
	err = initpseudoadhoc(padapter);
	if (err == _FAIL) {
		sprintf(pmsg, "loopback FAIL! 1.1 init ad-hoc FAIL!");
		return;
	}

	err = createpseudoadhoc(padapter);
	if (err == _FAIL) {
		sprintf(pmsg, "loopback FAIL! 1.2 create ad-hoc master FAIL!");
		return;
	}

	err = initLoopback(padapter);
	if (err) {
		sprintf(pmsg, "loopback FAIL! 2. init FAIL! error code=%d", err);
		return;
	}

	ploopback = padapter->ploopback;

	ploopback->bstop = _FALSE;
	ploopback->cnt = cnt;
	ploopback->size = size;
	ploopback->lbkthread = kthread_run(lbk_thread, padapter, "RTW_LBK_THREAD");
	if (IS_ERR(padapter->lbkthread))
	{
		freeLoopback(padapter);
		sprintf(pmsg, "loopback start FAIL! cnt=%d", cnt);
		return;
	}

	sprintf(pmsg, "loopback start! cnt=%d", cnt);
}
#endif // CONFIG_MAC_LOOPBACK_DRIVER

static int rtw_test(
	struct net_device *dev,
	struct iw_request_info *info,
	union iwreq_data *wrqu, char *extra)
{
	u32 len;
	u8 *pbuf, *pch;
	char *ptmp;
	u8 *delim = ",";
	int ret = 0;
	PADAPTER padapter = rtw_netdev_priv(dev);


	DBG_8723A("+%s\n", __func__);
	len = wrqu->data.length;

	pbuf = (u8*)kzalloc(len, GFP_KERNEL);
	if (pbuf == NULL) {
		DBG_8723A("%s: no memory!\n", __func__);
		return -ENOMEM;
	}

	if (copy_from_user(pbuf, wrqu->data.pointer, len)) {
		DBG_8723A("%s: copy from user fail!\n", __func__);
		ret = -EFAULT;
		goto out;
	}
	DBG_8723A("%s: string=\"%s\"\n", __func__, pbuf);

	ptmp = (char*)pbuf;
	pch = strsep(&ptmp, delim);
	if ((pch == NULL) || (strlen(pch) == 0)) {
		DBG_8723A("%s: parameter error(level 1)!\n", __func__);
		ret = -EFAULT;
		goto out;
	}

#ifdef CONFIG_MAC_LOOPBACK_DRIVER
	if (strcmp(pch, "loopback") == 0)
	{
		s32 cnt = 0;
		u32 size = 64;

		pch = strsep(&ptmp, delim);
		if ((pch == NULL) || (strlen(pch) == 0)) {
			DBG_8723A("%s: parameter error(level 2)!\n", __func__);
			ret = -EFAULT;
			goto out;
		}

		sscanf(pch, "%d", &cnt);
		DBG_8723A("%s: loopback cnt=%d\n", __func__, cnt);

		pch = strsep(&ptmp, delim);
		if ((pch == NULL) || (strlen(pch) == 0)) {
			DBG_8723A("%s: parameter error(level 2)!\n", __func__);
			ret = -EFAULT;
			goto out;
		}

		sscanf(pch, "%d", &size);
		DBG_8723A("%s: loopback size=%d\n", __func__, size);

		loopbackTest(padapter, cnt, size, extra);
		wrqu->data.length = strlen(extra) + 1;

		kfree(pbuf);
		return ret;
	}
#endif

#ifdef CONFIG_RTL8723A
#ifdef CONFIG_BT_COEXIST
#define GET_BT_INFO(padapter)	(&GET_HAL_DATA(padapter)->BtInfo)

	if (strcmp(pch, "btdbg") == 0)
	{
		DBG_8723A("===== BT debug information Start =====\n");
		DBG_8723A("WIFI status=\n");
		DBG_8723A("BT status=\n");
		DBG_8723A("BT profile=\n");
		DBG_8723A("WIFI RSSI=%d\n", GET_HAL_DATA(padapter)->dmpriv.UndecoratedSmoothedPWDB);
		DBG_8723A("BT RSSI=\n");
		DBG_8723A("coex mechanism=\n");
		DBG_8723A("BT counter TX/RX=/\n");
		DBG_8723A("0x880=0x%08x\n", rtw_read32(padapter, 0x880));
		DBG_8723A("0x6c0=0x%08x\n", rtw_read32(padapter, 0x6c0));
		DBG_8723A("0x6c4=0x%08x\n", rtw_read32(padapter, 0x6c4));
		DBG_8723A("0x6c8=0x%08x\n", rtw_read32(padapter, 0x6c8));
		DBG_8723A("0x6cc=0x%08x\n", rtw_read32(padapter, 0x6cc));
		DBG_8723A("0x778=0x%08x\n", rtw_read32(padapter, 0x778));
		DBG_8723A("0xc50=0x%08x\n", rtw_read32(padapter, 0xc50));
		BT_DisplayBtCoexInfo(padapter);
		DBG_8723A("===== BT debug information End =====\n");
	}

	if (strcmp(pch, "bton") == 0)
	{
		PBT30Info		pBTInfo = GET_BT_INFO(padapter);
		PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

		pBtMgnt->ExtConfig.bManualControl = _FALSE;
	}

	if (strcmp(pch, "btoff") == 0)
	{
		PBT30Info		pBTInfo = GET_BT_INFO(padapter);
		PBT_MGNT		pBtMgnt = &pBTInfo->BtMgnt;

		pBtMgnt->ExtConfig.bManualControl = _TRUE;
	}
#endif // CONFIG_BT_COEXIST

	if (strcmp(pch, "h2c") == 0)
	{
		u8 param[6];
		u8 count = 0;
		u32 tmp;
		u8 i;
		u32 pos;
		s32 ret;


		do {
			pch = strsep(&ptmp, delim);
			if ((pch == NULL) || (strlen(pch) == 0))
				break;

			sscanf(pch, "%x", &tmp);
			param[count++] = (u8)tmp;
		} while (count < 6);

		if (count == 0) {
			kfree(pbuf);
			DBG_8723A("%s: parameter error(level 2)!\n", __func__);
			return -EFAULT;
		}

		ret = FillH2CCmd(padapter, param[0], count-1, &param[1]);

		pos = sprintf(extra, "H2C ID=%x content=", param[0]);
		for (i=0; i<count; i++) {
			pos += sprintf(extra+pos, "%x,", param[i]);
		}
		extra[pos] = 0;
		pos--;
		pos += sprintf(extra+pos, " %s", ret==_FAIL?"FAIL":"OK");

		wrqu->data.length = strlen(extra) + 1;
	}
#endif // CONFIG_RTL8723A
out:
	kfree(pbuf);
	return 0;
}

static iw_handler rtw_handlers[] =
{
	NULL,					/* SIOCSIWCOMMIT */
	rtw_wx_get_name,		/* SIOCGIWNAME */
	dummy,					/* SIOCSIWNWID */
	dummy,					/* SIOCGIWNWID */
	rtw_wx_set_freq,		/* SIOCSIWFREQ */
	rtw_wx_get_freq,		/* SIOCGIWFREQ */
	rtw_wx_set_mode,		/* SIOCSIWMODE */
	rtw_wx_get_mode,		/* SIOCGIWMODE */
	dummy,					/* SIOCSIWSENS */
	rtw_wx_get_sens,		/* SIOCGIWSENS */
	NULL,					/* SIOCSIWRANGE */
	rtw_wx_get_range,		/* SIOCGIWRANGE */
	rtw_wx_set_priv,		/* SIOCSIWPRIV */
	NULL,					/* SIOCGIWPRIV */
	NULL,					/* SIOCSIWSTATS */
	NULL,					/* SIOCGIWSTATS */
	dummy,					/* SIOCSIWSPY */
	dummy,					/* SIOCGIWSPY */
	NULL,					/* SIOCGIWTHRSPY */
	NULL,					/* SIOCWIWTHRSPY */
	rtw_wx_set_wap,		/* SIOCSIWAP */
	rtw_wx_get_wap,		/* SIOCGIWAP */
	rtw_wx_set_mlme,		/* request MLME operation; uses struct iw_mlme */
	dummy,					/* SIOCGIWAPLIST -- depricated */
	rtw_wx_set_scan,		/* SIOCSIWSCAN */
	rtw_wx_get_scan,		/* SIOCGIWSCAN */
	rtw_wx_set_essid,		/* SIOCSIWESSID */
	rtw_wx_get_essid,		/* SIOCGIWESSID */
	dummy,					/* SIOCSIWNICKN */
	rtw_wx_get_nick,		/* SIOCGIWNICKN */
	NULL,					/* -- hole -- */
	NULL,					/* -- hole -- */
	rtw_wx_set_rate,		/* SIOCSIWRATE */
	rtw_wx_get_rate,		/* SIOCGIWRATE */
	rtw_wx_set_rts,			/* SIOCSIWRTS */
	rtw_wx_get_rts,			/* SIOCGIWRTS */
	rtw_wx_set_frag,		/* SIOCSIWFRAG */
	rtw_wx_get_frag,		/* SIOCGIWFRAG */
	dummy,					/* SIOCSIWTXPOW */
	dummy,					/* SIOCGIWTXPOW */
	dummy,					/* SIOCSIWRETRY */
	rtw_wx_get_retry,		/* SIOCGIWRETRY */
	rtw_wx_set_enc,			/* SIOCSIWENCODE */
	rtw_wx_get_enc,			/* SIOCGIWENCODE */
	dummy,					/* SIOCSIWPOWER */
	rtw_wx_get_power,		/* SIOCGIWPOWER */
	NULL,					/*---hole---*/
	NULL,					/*---hole---*/
	rtw_wx_set_gen_ie,		/* SIOCSIWGENIE */
	NULL,					/* SIOCGWGENIE */
	rtw_wx_set_auth,		/* SIOCSIWAUTH */
	NULL,					/* SIOCGIWAUTH */
	rtw_wx_set_enc_ext,		/* SIOCSIWENCODEEXT */
	NULL,					/* SIOCGIWENCODEEXT */
	rtw_wx_set_pmkid,		/* SIOCSIWPMKSA */
	NULL,					/*---hole---*/
};

